nxp-mcuxpresso/mcux-soc-svd/MCXA346/MCXA346.xml
                  <description>PWM1_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val91</name>
                  <description>PWM1_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x5B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val92</name>
                  <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x5C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val93</name>
                  <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x5D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val94</name>
                  <description>LPI2C2 Master End of Packet input is selected</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val95</name>
                  <description>LPI2C2 Slave End of Packet input is selected</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val96</name>
                  <description>LPI2C3 Master End of Packet input is selected</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val97</name>
                  <description>LPI2C3 Slave End of Packet input is selected</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val98</name>
                  <description>LPUART5 Received Data Word input is selected</description>
                  <value>0x62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val99</name>
                  <description>LPUART5 Transmitted Data Word input is selected</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val100</name>
                  <description>LPUART5 Receive Line Idle input is selected</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val105</name>
                  <description>ADC2_tcomp[0] input is selected</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val106</name>
                  <description>ADC2_tcomp[1] input is selected</description>
                  <value>0x6A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val107</name>
                  <description>ADC2_tcomp[2] input is selected</description>
                  <value>0x6B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val108</name>
                  <description>ADC2_tcomp[3] input is selected</description>
                  <value>0x6C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val109</name>
                  <description>ADC3_tcomp[0] input is selected</description>
                  <value>0x6D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val110</name>
                  <description>ADC3_tcomp[1] input is selected</description>
                  <value>0x6E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val111</name>
                  <description>ADC3_tcomp[2] input is selected</description>
                  <value>0x6F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val112</name>
                  <description>ADC3_tcomp[3] input is selected</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val113</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val114</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val115</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val116</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val117</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val118</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val119</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val120</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val121</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val122</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x7A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val123</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x7B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val124</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x7C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
