nxp-mcuxpresso/mcux-soc-svd/MCXA346/MCXA346.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART1</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART1</name>
        <value>32</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART2</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART2</name>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART3</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART3</name>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART4</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART4</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART5</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400DA000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART5</name>
        <value>95</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>EQDC0</name>
      <description>Enhanced Quadrature Decoder (eQDC)</description>
      <groupName>EQDC</groupName>
      <headerStructName>EQDC</headerStructName>
      <baseAddress>0x400A7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EQDC0_COMPARE</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_HOME</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_WATCHDOG</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_INDEX</name>
        <value>53</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LDOK</name>
              <description>Load Okay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOK0</name>
                  <description>No loading action taken. Users can write new values to buffered registers (writing into outer-set of these buffered registers)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOK1</name>
                  <description>Outer-set values are ready to be loaded into inner-set and take effect. The loading time point depends on CTRL2[LDMOD].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_0</name>
                  <description>DMA is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_1</name>
                  <description>DMA is enabled. DMA request asserts automatically when the values in the outer-set of buffered compare registers (UCOMP0/LCOMP0;UCOMP1/LCOMP1;UCOMP2/LCOMP2;UCOMP3/LCOMP3), initial registers(UINIT/LINIT) and modulus registers (UMOD/LMOD) are loaded into the inner-set of buffer and then LDOK is cleared automatically. After the completion of this DMA transfer, LDOK is set automatically, it ensures outer-set values can be loaded into inner-set which in turn triggers DMA again.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>Watchdog Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDE0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDE1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timeout Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDIE0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDIE1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDIRQ</name>
              <description>Watchdog Timeout Interrupt Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDIRQ0</name>
                  <description>No Watchdog timeout interrupt has occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDIRQ1</name>
                  <description>Watchdog timeout interrupt has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XNE</name>
              <description>Select Positive/Negative Edge of INDEX/PRESET Pulse</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XNE0</name>
                  <description>Use positive edge of INDEX/PRESET pulse</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XNE1</name>
                  <description>Use negative edge of INDEX/PRESET pulse</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIP</name>
              <description>INDEX Triggered Initialization of Position Counters UPOS and LPOS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XIP0</name>
                  <description>INDEX pulse does not initialize the position counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIP1</name>
                  <description>INDEX pulse initializes the position counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIE</name>
              <description>INDEX/PRESET Pulse Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XIE0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIE1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIRQ</name>
              <description>INDEX/PRESET Pulse Interrupt Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XIRQ0</name>
                  <description>INDEX/PRESET pulse has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIRQ1</name>
                  <description>INDEX/PRESET pulse has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PH1</name>
              <description>Enable Single Phase Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PH10</name>
                  <description>Standard quadrature decoder, where PHASEA and PHASEB represent a two-phase quadrature signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PH11</name>
                  <description>Single phase mode, bypass the quadrature decoder, refer to CTRL2[CMODE] description</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REV</name>
              <description>Enable Reverse Direction Counting</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV0</name>
                  <description>Count normally and the position counter initialization uses upper/lower initialization register UINIT/LINIT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV1</name>
                  <description>Count in the reverse direction and the position counter initialization uses upper/lower modulus register UMOD/LMOD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWIP</name>
              <description>Software-Triggered Initialization of Position Counters UPOS and LPOS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWIP0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWIP1</name>
                  <description>Initialize position counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HNE</name>
              <description>Use Negative Edge of HOME/ENABLE Input</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HNE0</name>
                  <description>When CTRL[OPMODE] = 0,use HOME positive edge to trigger initialization of position counters. When CTRL[OPMODE] = 1,use ENABLE high level to enable POS/POSD/WDG/REV counters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HNE1</name>
                  <description>When CTRL[OPMODE] = 0,use HOME negative edge to trigger initialization of position counters. When CTRL[OPMODE] = 1,use ENABLE low level to enable POS/POSD/WDG/REV counters</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIP</name>
              <description>Enable HOME to Initialize Position Counter UPOS/LPOS</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIP0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIP1</name>
                  <description>HOME signal initializes the position counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIE</name>
              <description>HOME/ENABLE Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIE0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIE1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRQ</name>
              <description>HOME/ENABLE Signal Transition Interrupt Request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIRQ0</name>
                  <description>No transition on the HOME/ENABLE signal has occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIRQ1</name>
                  <description>A transition on the HOME/ENABLE signal has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
